"""Задания по стилю кода и именованию переменных."""

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None

# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым

# назови переменную, которая хранит текущее количество студентов в потоке

# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45

# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
