"""Задания по ветвлениям, итерациям и вводу данных."""

# напиши функцию, которая принимает на вход любое
# количество чисел и сообщает, есть ли среди них чётное


# используй тернарный оператор, чтобы вызвать функцию
# если возраст больше 21 года, в противном случае верни
# сообщение "Мы не продаём алкоголь несовершеннолетним."
age = 17
sell_alcohol()


# напиши функцию, которая проверит, является ли строка ключевым словом в Питоне
# тебе понадобится модуль keyword, импортируй его и изучи с помощью dir()


# напиши функцию, которая возвращает тип данных на русском языке:
# число, строка, булевый, None, список, кортеж, множество, словарь
# пример: get_type("что-то") возвращает "Это строка."
# пример2: get_type(42) возвращает "Это словарь."


# возьми два небольших текста (на твоё усмотрение) и заключи в тройные кавычки
# сделай из этих строк список слов (для этого воспользуйся нужным методом)
# при помощи операций с множествами найди уникальные для каждого текста слова и
# сохрани их в две переменных, и общие слова, сохрани их в третью переменную


# скачай любую большую книгу в формате txt (язык книги на твоё усмотрение)
# научись работать с файлами в Питоне (как открывать, как считывать данные)
# составь словарь частотности топ-100 слов книги, чтобы ключом было слово,
# а значением было количество вхождений этого слова
# в словаре не должно быть стоп-слов (междометий, союзов, местоимений и т.д.)
# список стоп-слов возьми в популярном пакете NLTK:
# подсказка: from nltk.corpus import stopwords
